social-flow-backend/performance/artillery/social_flow.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:8003' }}"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - name: "mixed_traffic"
    flow:
      - get:
          url: "/health"
      - loop:
          count: 3
          steps:
            - get:
                url: "/recommendations/{{ randomString() }}"
            - get:
                url: "/trending"
      - post:
          url: "/feedback"
          json:
            user_id: "{{ randomString() }}"
            item_id: "video_{{ randomNumber(1,100) }}"
            action: "view"
            timestamp: "{{ int((new Date()).getTime()/1000) }}"